---
kind: type
id: T:Autodesk.Revit.DB.Visual.PlasticVinyl
source: html/f2f81383-0340-7868-72f1-a7bb4a4a2eaa.htm
---
# Autodesk.Revit.DB.Visual.PlasticVinyl

A static class that provides access to the property names that appear in the PlasticVinyl visual asset schema.

## Syntax (C#)
```csharp
public static class PlasticVinyl
```